tutorials/case3D/0.orig/gradT
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      gradT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurf
    {
        type            calculated;
        value           $internalField;
    }

    side
    {
        type            calculated;
        value           $internalField;
    }

    bottom
    {
        type            calculated;
        value           $internalField;
    }

    crysSurf
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
